In [1]:
import numpy as np
import pandas as pd

### Reading and Writing Data

In [2]:
df_empl = pd.read_excel('sample_data.xlsx',sheet_name='Employee Data')

In [3]:
df_empl

  Employee Department  Salary  Years of Service  Total_sal
0     John         HR   50000                 5     250000
1     Jane      Sales   60000                 7     420000
2      Max         IT   55000                 3     165000
3     Anna    Finance   70000                10     700000
4      Tom  Marketing   65000                 8     520000

In [4]:
df_project = pd.read_excel('sample_data.xlsx',sheet_name=1)

ValueError: Worksheet index 1 is invalid, 1 worksheets found

In [ ]:
df_project

In [ ]:
df_csv = pd.read_csv('sample_data.csv')

In [ ]:
df_csv

In [ ]:
df_csv['Sales'] = df_csv['Price']*df_csv['Quantity Sold']

In [ ]:
df_csv

In [ ]:
df_csv.to_csv('Sample_Data.csv') # Writing it back to csv

In [ ]:
df_empl['Total_sal'] = df_empl['Salary'] * df_empl['Years of Service']

In [ ]:
df_empl.head()

In [ ]:
df_empl.drop(columns = ['total_sal'],inplace= True)

In [ ]:
df_empl

In [ ]:
with pd.ExcelWriter('sample_data.xlsx',engine = 'xlsxwriter') as writer:
    df_empl.to_excel(writer,sheet_name='Employee Data', index = False)

### Creating dataframe

__From Dictionary of lists or arrays__

In [ ]:
data = {'Name':['Mudit','Alice','Bob'],'Age':[20,22,44],'Department':['Owner son','Marketing','HR']}
df = pd.DataFrame(data)

In [ ]:
df

__From list of Dictionaries__

In [ ]:
data = [ {'Name': 'John', 'Age': 23, 'Department': 'Sales'},
    {'Name': 'Alice', 'Age': 30, 'Department': 'Marketing'},
    {'Name': 'Bob', 'Age': 45, 'Department': 'HR'}]

df1 = pd.DataFrame(data)

In [ ]:
df1

__From list of lists__

In [ ]:
data = [ ['John', 23, 'Sales'],
    ['Alice', 39, 'Marketing'],
    ['Bob', 49, 'HR']]
column_name = ['Name','Age','Department']
df2= pd.DataFrame(data, columns=column_name)

In [ ]:
df2

__From 2d Numpy Array__

In [ ]:
data = np.random.rand(5,6)

In [ ]:
df3 = pd.DataFrame(data,columns=['A','B','C','D','E','F'])

In [ ]:
df3

__From Dictionary of Series__

In [ ]:
data = {'Name': pd.Series(['John','Alice','Bob'],index=[1,2,3]),
       'Age':pd.Series([33,44,45],index = [1,2,3]),
       'Department': pd.Series(['Sales', 'Marketing', 'HR'], index=[1, 2, 3])}
df4 = pd.DataFrame(data)

In [ ]:
df4

__From a DataFrame Subset__

In [ ]:
df4_new= df4[['Name','Department']]

In [ ]:
df4_new

__From a Scalar Value__

df5 = pd.DataFrame(10,index = range(1,6),columns=['A','B','C'])

In [ ]:
df5

__From a zip object__

In [ ]:
names = ['John', 'Alice', 'Bob']
ages = [23, 30, 45]
departments = ['Sales', 'Marketing', 'HR']
df6 = pd.DataFrame(list(zip(names,ages,departments)),columns=['Name', 'Age', 'Department'])

In [ ]:
df6

__Empty DataFrame and Adding Rows__

In [ ]:
df = pd.DataFrame(columns=['Name','Age','Department'])
new_row = pd.DataFrame([{'Name': 'John', 'Age': 23, 'Department': 'Sales'}])
df = pd.concat([df, new_row], ignore_index=True)
### When you create a DataFrame from a dictionary of lists (or arrays), pandas assumes that each key in the dictionary is a column name, and each list (or array) associated with the key represents the data for that column.###

In [ ]:
df

__From dictionary of tuples__

In [ ]:
data = {
    'Name': ('John', 'Alice', 'Bob'),
    'Age': (23, 30, 45),
    'Department': ('Sales', 'Marketing', 'HR')
}
df = pd.DataFrame(data)
print(df)

### Viewing data

In [ ]:
df.head()

In [ ]:
df_empl.tail(2)

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.describe()

### Selecting data

In [ ]:
df['Age'] # Select a column and return as series

In [ ]:
df[['Age','Name']]

In [ ]:
df.iloc[1]  #return row df.iloc[row_index,column_index]

In [ ]:
df.loc[:,'Name']

In [ ]:
df.iloc[0:2] #return first two row

In [ ]:
df.iloc[0:2,0] # return first two row and 1 st column only

In [5]:
data = {
    'Name': ['John', 'Alice', 'Bob', 'Alice', 'Eve', np.nan, 'John'],
    'Age': [23, 30, 45, 30, np.nan, 29, 23],
    'Department': ['Sales', 'Marketing', 'HR', 'Marketing', np.nan, 'IT', 'Sales'],
    'Salary': [50000, 60000, 70000, 60000, 80000, np.nan, 50000]
}

df = pd.DataFrame(data)

In [6]:
df

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [7]:
df.isnull() # return true whereever is null

    Name    Age  Department  Salary
0  False  False       False   False
1  False  False       False   False
2  False  False       False   False
3  False  False       False   False
4  False   True        True   False
5   True  False       False    True
6  False  False       False   False

___df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)___
Parameters:
axis:

0 or 'index' (default): Drop rows with missing values.
1 or 'columns': Drop columns with missing values.
how:

'any' (default): Drop if any NaN value is present in the row/column.
'all': Drop if all values are NaN.
thresh: Require a minimum number of non-NaN values to retain the row/column.

subset: Specifies a list of columns (or rows) to check for NaN values.

inplace:

False (default): Returns a new DataFrame.
True: Modifies the original DataFrame in place.___

In [8]:
df.dropna(axis = 1,how = 'all')

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [9]:
df.fillna("None") # fill na

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve  None       None  80000.0
5   None  29.0         IT     None
6   John  23.0      Sales  50000.0

### Data Manipulation

__Rename Columns__

df.rename(columns={'old_name1': 'new_name1', 'old_name2': 'new_name2'}, inplace=False)

In [10]:
df.rename(columns = {'Department':'Dept'},inplace=False)

    Name   Age       Dept   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

___Dropping Columns or Rows__

df.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')

labels is common for row and column

Drop row with label 1

df_dropped_row = df.drop(labels=1, axis=0)

Drop the 'Department' column using label

df_dropped_column = df.drop(labels='Department', axis=1)




Use df.drop(index=...) to drop rows by their index.
Use df.drop(columns=...) to drop columns by their names.
You can drop multiple indices or columns at once by passing lists.

In [11]:
df

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [12]:
df.drop(index = 3) # 3 is row name

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [13]:
df.drop(columns = 'Age')

    Name Department   Salary
0   John      Sales  50000.0
1  Alice  Marketing  60000.0
2    Bob         HR  70000.0
3  Alice  Marketing  60000.0
4    Eve        NaN  80000.0
5    NaN         IT      NaN
6   John      Sales  50000.0

In [14]:
df.drop(labels = 'Salary',axis = 1)

    Name   Age Department
0   John  23.0      Sales
1  Alice  30.0  Marketing
2    Bob  45.0         HR
3  Alice  30.0  Marketing
4    Eve   NaN        NaN
5    NaN  29.0         IT
6   John  23.0      Sales

In [15]:
df.drop(labels = 1,axis = 0)

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [16]:
df.drop('Salary',axis = 1)

    Name   Age Department
0   John  23.0      Sales
1  Alice  30.0  Marketing
2    Bob  45.0         HR
3  Alice  30.0  Marketing
4    Eve   NaN        NaN
5    NaN  29.0         IT
6   John  23.0      Sales

In [17]:
df.drop(1,axis = 0)

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

### Sorting Data

DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False)

In [18]:
df.sort_values('Salary',axis = 0, ascending= False)

    Name   Age Department   Salary
4    Eve   NaN        NaN  80000.0
2    Bob  45.0         HR  70000.0
1  Alice  30.0  Marketing  60000.0
3  Alice  30.0  Marketing  60000.0
0   John  23.0      Sales  50000.0
6   John  23.0      Sales  50000.0
5    NaN  29.0         IT      NaN

In [20]:
df.reset_index(drop = True)

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

In [27]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [28]:
df

    Name   Age Department   Salary
A   John  23.0      Sales  50000.0
B  Alice  30.0  Marketing  60000.0
C    Bob  45.0         HR  70000.0
D  Alice  30.0  Marketing  60000.0
E    Eve   NaN        NaN  80000.0
F    NaN  29.0         IT      NaN
G   John  23.0      Sales  50000.0

In [31]:
df.reset_index()

  index   Name   Age Department   Salary
0     A   John  23.0      Sales  50000.0
1     B  Alice  30.0  Marketing  60000.0
2     C    Bob  45.0         HR  70000.0
3     D  Alice  30.0  Marketing  60000.0
4     E    Eve   NaN        NaN  80000.0
5     F    NaN  29.0         IT      NaN
6     G   John  23.0      Sales  50000.0

In [32]:
df.reset_index(drop = True)

    Name   Age Department   Salary
0   John  23.0      Sales  50000.0
1  Alice  30.0  Marketing  60000.0
2    Bob  45.0         HR  70000.0
3  Alice  30.0  Marketing  60000.0
4    Eve   NaN        NaN  80000.0
5    NaN  29.0         IT      NaN
6   John  23.0      Sales  50000.0

### Statiscal Function

In [36]:
df['Age'].mean()

30.0

In [37]:
df['Salary'].median()

60000.0

In [38]:
df['Salary'].min()

50000.0

In [39]:
df['Salary'].max()

80000.0

In [40]:
df['Age'].std()

8.049844718999243

In [42]:
df['Age'].var()

64.8

### Merging and Joining data

In [43]:
data_new = {
    'Name': ['John', 'Alice', 'David', 'Eve', 'Grace'],
    'Position': ['Manager', 'Executive', 'Analyst', 'Manager', 'Analyst'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Houston'],
    'Bonus': [5000, 6000, 7000, 8000, 9000]
}

df_new = pd.DataFrame(data_new)

In [44]:
df_new

    Name   Position     Location  Bonus
0   John    Manager     New York   5000
1  Alice  Executive  Los Angeles   6000
2  David    Analyst      Chicago   7000
3    Eve    Manager     New York   8000
4  Grace    Analyst      Houston   9000

In [45]:
df

    Name   Age Department   Salary
A   John  23.0      Sales  50000.0
B  Alice  30.0  Marketing  60000.0
C    Bob  45.0         HR  70000.0
D  Alice  30.0  Marketing  60000.0
E    Eve   NaN        NaN  80000.0
F    NaN  29.0         IT      NaN
G   John  23.0      Sales  50000.0

In [83]:
df_merge = pd.merge(df,df_new,on='Name')

In [68]:
a=df.set_index('Name')
b=df_new.set_index('Name')
a.join(b)

        Age Department   Salary   Position     Location   Bonus
Name
John   23.0      Sales  50000.0    Manager     New York  5000.0
Alice  30.0  Marketing  60000.0  Executive  Los Angeles  6000.0
Bob    45.0         HR  70000.0        NaN          NaN     NaN
Alice  30.0  Marketing  60000.0  Executive  Los Angeles  6000.0
Eve     NaN        NaN  80000.0    Manager     New York  8000.0
NaN    29.0         IT      NaN        NaN          NaN     NaN
John   23.0      Sales  50000.0    Manager     New York  5000.0

In [69]:
df_new

    Name   Position     Location  Bonus
0   John    Manager     New York   5000
1  Alice  Executive  Los Angeles   6000
2  David    Analyst      Chicago   7000
3    Eve    Manager     New York   8000
4  Grace    Analyst      Houston   9000

In [73]:
pivot_table = df_merge.pivot_table(values='Salary',index='Location',columns='Position')

In [74]:
pivot_table

Position     Executive  Manager
Location
Los Angeles    60000.0      NaN
New York           NaN  60000.0

In [72]:
df_merge

    Name   Age Department   Salary   Position     Location   Bonus
0  Alice  30.0  Marketing  60000.0  Executive  Los Angeles  6000.0
1  Alice  30.0  Marketing  60000.0  Executive  Los Angeles  6000.0
2    Bob  45.0         HR  70000.0        NaN          NaN     NaN
3  David   NaN        NaN      NaN    Analyst      Chicago  7000.0
4    Eve   NaN        NaN  80000.0    Manager     New York  8000.0
5  Grace   NaN        NaN      NaN    Analyst      Houston  9000.0
6   John  23.0      Sales  50000.0    Manager     New York  5000.0
7   John  23.0      Sales  50000.0    Manager     New York  5000.0
8    NaN  29.0         IT      NaN        NaN          NaN     NaN

### Handling duplicates

In [75]:
df

    Name   Age Department   Salary
A   John  23.0      Sales  50000.0
B  Alice  30.0  Marketing  60000.0
C    Bob  45.0         HR  70000.0
D  Alice  30.0  Marketing  60000.0
E    Eve   NaN        NaN  80000.0
F    NaN  29.0         IT      NaN
G   John  23.0      Sales  50000.0

In [76]:
df.duplicated()

A    False
B    False
C    False
D     True
E    False
F    False
G     True
dtype: bool

In [79]:
df.drop_duplicates() 
#DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)

    Name   Age Department   Salary
A   John  23.0      Sales  50000.0
B  Alice  30.0  Marketing  60000.0
C    Bob  45.0         HR  70000.0
E    Eve   NaN        NaN  80000.0
F    NaN  29.0         IT      NaN

### Reshaping data

Melting in pandas is a process of transforming a DataFrame from a wide format to a long format. This is useful when you want to make the data easier to analyze or visualize by consolidating multiple columns into a single column for variable values.

Key Concepts of Melting
Wide Format: Each variable is in a separate column. For example, you might have separate columns for sales in different regions.
Long Format: Each variable is stored in a single column, making it easier to work with functions that expect data in this format.
pd.melt Function
The pd.melt() function is used to "unpivot" or "melt" a DataFrame. Heres how it works:

Syntax:
python
Copy code

pd.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True)

Parameters:
frame: The DataFrame to melt.

id_vars: Columns to keep as identifier variables. These will not be melted and remain in the DataFrame.

value_vars: Columns to unpivot (melt). If not specified, all columns not in id_vars will be used.

var_name: Name to use for the variable column. If None, it uses the default name variable.

value_name: Name to use for the value column. Default is 'value'.
Example of Melting

In [90]:
# Melting the DataFrame
melted_df = pd.melt(df_merge, id_vars='Name', value_vars=['Salary','Bonus','Location'])

In [91]:
melted_df

     Name  variable        value
0    John    Salary      50000.0
1   Alice    Salary      60000.0
2   Alice    Salary      60000.0
3     Eve    Salary      80000.0
4    John    Salary      50000.0
5    John     Bonus         5000
6   Alice     Bonus         6000
7   Alice     Bonus         6000
8     Eve     Bonus         8000
9    John     Bonus         5000
10   John  Location     New York
11  Alice  Location  Los Angeles
12  Alice  Location  Los Angeles
13    Eve  Location     New York
14   John  Location     New York

In [100]:
# Horizontal Concatenation
horizontal_concat = pd.concat([df.reset_index(drop=True), df_new.reset_index(drop=True)], axis=1)

print(horizontal_concat)

    Name   Age Department   Salary   Name   Position     Location   Bonus
0   John  23.0      Sales  50000.0   John    Manager     New York  5000.0
1  Alice  30.0  Marketing  60000.0  Alice  Executive  Los Angeles  6000.0
2    Bob  45.0         HR  70000.0  David    Analyst      Chicago  7000.0
3  Alice  30.0  Marketing  60000.0    Eve    Manager     New York  8000.0
4    Eve   NaN        NaN  80000.0  Grace    Analyst      Houston  9000.0
5    NaN  29.0         IT      NaN    NaN        NaN          NaN     NaN
6   John  23.0      Sales  50000.0    NaN        NaN          NaN     NaN

### Time series data

In [104]:
df_dt = pd.to_datetime(df['Age'])

A   1970-01-01 00:00:00.000000023
B   1970-01-01 00:00:00.000000030
C   1970-01-01 00:00:00.000000045
D   1970-01-01 00:00:00.000000030
E                             NaT
F   1970-01-01 00:00:00.000000029
G   1970-01-01 00:00:00.000000023
Name: Age, dtype: datetime64[ns]

In [105]:
df_dt

A   1970-01-01 00:00:00.000000023
B   1970-01-01 00:00:00.000000030
C   1970-01-01 00:00:00.000000045
D   1970-01-01 00:00:00.000000030
E                             NaT
F   1970-01-01 00:00:00.000000029
G   1970-01-01 00:00:00.000000023
Name: Age, dtype: datetime64[ns]

In [117]:


# Create the DataFrame
data = {
    'dates': ['2023-01-01', '2023-02-15', '2023-03-20']
}
df_dt = pd.DataFrame(data)
df_dt

        dates
0  2023-01-01
1  2023-02-15
2  2023-03-20

In [120]:
# Convert the 'dates' column to datetime
df_dt['dates'] = pd.to_datetime(df_dt['dates'])

# Print the DataFrame to verify the conversion
print(df_dt)

       dates
0 2023-01-01
1 2023-02-15
2 2023-03-20

In [121]:
df_dt['year'] = df_dt['dates'].dt.year

In [122]:
df_dt

       dates  year
0 2023-01-01  2023
1 2023-02-15  2023
2 2023-03-20  2023

In [124]:
df_dt['month'] = df_dt['dates'].dt.month

In [125]:
df_dt

       dates  year  month
0 2023-01-01  2023      1
1 2023-02-15  2023      2
2 2023-03-20  2023      3

### Advanced Operatons

__Apply Method__

Using apply on a Series (Column)

The apply method allows you to apply a function to each element in a specific column (or Series) of a DataFrame.

df['column'].apply(function)

In [127]:
df['Increment Salary'] = df['Salary'].apply(lambda salary: salary * 1.25)

In [128]:
df

    Name   Age Department   Salary  Increment Salary
A   John  23.0      Sales  50000.0           62500.0
B  Alice  30.0  Marketing  60000.0           75000.0
C    Bob  45.0         HR  70000.0           87500.0
D  Alice  30.0  Marketing  60000.0           75000.0
E    Eve   NaN        NaN  80000.0          100000.0
F    NaN  29.0         IT      NaN               NaN
G   John  23.0      Sales  50000.0           62500.0

__ApplyMap__

The applymap method is used to apply a function element-wise across all cells in the DataFrame. This is useful when you want to perform an operation on every single element.

In [131]:
df_upper = df.applymap(lambda x: len(str(x)))

C:\Users\User\AppData\Local\Temp\ipykernel_15172\2052875372.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_upper = df.applymap(lambda x: len(str(x)))

In [132]:
df_upper

   Name  Age  Department  Salary  Increment Salary
A     4    4           5       7                 7
B     5    4           9       7                 7
C     3    4           2       7                 7
D     5    4           9       7                 7
E     3    3           3       7                 8
F     3    4           2       3                 3
G     4    4           5       7                 7

What are Window Functions?

Window functions allow you to perform calculations over a "window" of data points. This means you can analyze a specific number of rows in your DataFrame to get insights like averages or sums.

1. Rolling Mean
2. 
Syntax: df.rolling(window=n).mean()

What it does: This function calculates the average (mean) of the current row and the previous n-1 rows.

In [134]:
data = {
    'values': [10, 20, 30, 40, 50, 60]
}
dff = pd.DataFrame(data)

# Calculate the rolling mean with a window of 3
rolling_mean = dff['values'].rolling(window=3).mean()

print(rolling_mean)

0     NaN
1     NaN
2    20.0
3    30.0
4    40.0
5    50.0
Name: values, dtype: float64

In [135]:
df

    Name   Age Department   Salary  Increment Salary
A   John  23.0      Sales  50000.0           62500.0
B  Alice  30.0  Marketing  60000.0           75000.0
C    Bob  45.0         HR  70000.0           87500.0
D  Alice  30.0  Marketing  60000.0           75000.0
E    Eve   NaN        NaN  80000.0          100000.0
F    NaN  29.0         IT      NaN               NaN
G   John  23.0      Sales  50000.0           62500.0

In [138]:
df['Salary'].rolling(window=2).mean()

A        NaN
B    55000.0
C    65000.0
D    65000.0
E    70000.0
F        NaN
G        NaN
Name: Salary, dtype: float64

In [139]:
df['Salary'].rolling(window=2).max()

A        NaN
B    60000.0
C    70000.0
D    70000.0
E    80000.0
F        NaN
G        NaN
Name: Salary, dtype: float64

In [144]:
df['Salary'].rolling(window=2).apply(lambda x: True if x.iloc[0]>x.iloc[1] else False)

A    NaN
B    0.0
C    0.0
D    1.0
E    0.0
F    NaN
G    NaN
Name: Salary, dtype: float64

__Expanding Sum__

Syntax: df.expanding().sum()

What it does: This function calculates the cumulative sum of values from the start of the DataFrame to the current row.

In [149]:
df['Salary'].expanding().sum()

A     50000.0
B    110000.0
C    180000.0
D    240000.0
E    320000.0
F    320000.0
G    370000.0
Name: Salary, dtype: float64

In [161]:
df_str = df.applymap(lambda x: str(x))
# Assuming df_str is the DataFrame with strings
type_check = df_str.applymap(type)
print(type_check)

            Name            Age     Department         Salary  \
A  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
B  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
C  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
D  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
E  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
F  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>
G  <class 'str'>  <class 'str'>  <class 'str'>  <class 'str'>

  Increment Salary     is_greater
A    <class 'str'>  <class 'str'>
B    <class 'str'>  <class 'str'>
C    <class 'str'>  <class 'str'>
D    <class 'str'>  <class 'str'>
E    <class 'str'>  <class 'str'>
F    <class 'str'>  <class 'str'>
G    <class 'str'>  <class 'str'>

C:\Users\User\AppData\Local\Temp\ipykernel_15172\1093726586.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_str = df.applymap(lambda x: str(x))
C:\Users\User\AppData\Local\Temp\ipykernel_15172\1093726586.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  type_check = df_str.applymap(type)

In [162]:
df_str.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              7 non-null      object
 1   Age               7 non-null      object
 2   Department        7 non-null      object
 3   Salary            7 non-null      object
 4   Increment Salary  7 non-null      object
 5   is_greater        7 non-null      object
dtypes: object(6)
memory usage: 692.0+ bytes

__Quick note: df['column_name'] and df.loc[row_label, column_label]__

expanding doesnt work on string

In [165]:
data = {
    'A': np.random.randint(1, 100, size=5),  # Column A with random integers
    'B': np.random.uniform(1.0, 100.0, size=5),  # Column B with random floats
    'C': np.random.randint(1, 100, size=5)  # Column C with random integers
}

df_numeric = pd.DataFrame(data)

In [166]:
df_numeric

    A          B   C
0  46  41.068170  47
1  94  52.626178  12
2  47  82.924297  47
3  50  21.229524  76
4  65  35.125596  89

In [167]:
df_numeric.iloc[1].expanding().sum()

A     94.000000
B    146.626178
C    158.626178
Name: 1, dtype: float64

## DataFrame Transformations

In [168]:
df

    Name   Age Department   Salary  Increment Salary  is_greater
A   John  23.0      Sales  50000.0           62500.0         NaN
B  Alice  30.0  Marketing  60000.0           75000.0         0.0
C    Bob  45.0         HR  70000.0           87500.0         0.0
D  Alice  30.0  Marketing  60000.0           75000.0         1.0
E    Eve   NaN        NaN  80000.0          100000.0         0.0
F    NaN  29.0         IT      NaN               NaN         NaN
G   John  23.0      Sales  50000.0           62500.0         NaN

In [170]:
df.T # Transpose

,A,B,C,D,E,F,G
Name,John,Alice,Bob,Alice,Eve,NaN,John
Age,23.0,30.0,45.0,30.0,NaN,29.0,23.0
Department,Sales,Marketing,HR,Marketing,NaN,IT,Sales
Salary,50000.0,60000.0,70000.0,60000.0,80000.0,NaN,50000.0
Increment Salary,62500.0,75000.0,87500.0,75000.0,100000.0,NaN,62500.0
is_greater,NaN,0.0,0.0,1.0,0.0,NaN,NaN

__Vectorized Operations__

In [171]:
df

    Name   Age Department   Salary  Increment Salary  is_greater
A   John  23.0      Sales  50000.0           62500.0         NaN
B  Alice  30.0  Marketing  60000.0           75000.0         0.0
C    Bob  45.0         HR  70000.0           87500.0         0.0
D  Alice  30.0  Marketing  60000.0           75000.0         1.0
E    Eve   NaN        NaN  80000.0          100000.0         0.0
F    NaN  29.0         IT      NaN               NaN         NaN
G   John  23.0      Sales  50000.0           62500.0         NaN

In [172]:
df['Salary'] * 0.5

A    25000.0
B    30000.0
C    35000.0
D    30000.0
E    40000.0
F        NaN
G    25000.0
Name: Salary, dtype: float64

In [179]:
df_new.set_index(['Name'])

        Position     Location  Bonus
Name
John     Manager     New York   5000
Alice  Executive  Los Angeles   6000
David    Analyst      Chicago   7000
Eve      Manager     New York   8000
Grace    Analyst      Houston   9000

In [180]:
df.set_index(['Name'])

        Age Department   Salary  Increment Salary  is_greater
Name
John   23.0      Sales  50000.0           62500.0         NaN
Alice  30.0  Marketing  60000.0           75000.0         0.0
Bob    45.0         HR  70000.0           87500.0         0.0
Alice  30.0  Marketing  60000.0           75000.0         1.0
Eve     NaN        NaN  80000.0          100000.0         0.0
NaN    29.0         IT      NaN               NaN         NaN
John   23.0      Sales  50000.0           62500.0         NaN